In [3]:
import numpy as np
import pandas as pd

In [115]:
s = pd.Series([1,3,5,np.nan,6,8], index=["A", "B","C","D","E","F"])

In [116]:
s

A    1.0
B    3.0
C    5.0
D    NaN
E    6.0
F    8.0
dtype: float64

In [120]:
s.A

1.0

# DataFrame

In [6]:
dates = pd.date_range('20130101', periods=6)

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [9]:
df

                   A         B         C         D
2013-01-01  0.207720 -1.075204 -0.583221 -0.811650
2013-01-02 -1.454012  0.574643 -2.112604  1.523709
2013-01-03 -1.019793 -0.160165 -1.796301  0.306590
2013-01-04 -0.125696  1.479283 -0.960221 -1.155188
2013-01-05 -2.392148 -0.253680 -0.523627  0.602100
2013-01-06 -1.892601  1.657452  0.447012  0.490455

In [10]:
df2 = pd.DataFrame({'A': 1.,
   ...:                     'B': pd.Timestamp('20130102'),
   ...:                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
   ...:                     'D': np.array([3] * 4, dtype='int32'),
   ...:                     'E': pd.Categorical(["test", "train", "test", "train"]),
   ...:                     'F': 'foo'})

In [11]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [13]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [27]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [28]:
df2.tail(3)

     A          B    C  D      E    F
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [30]:
df

                   A         B         C         D
2013-01-01  0.207720 -1.075204 -0.583221 -0.811650
2013-01-02 -1.454012  0.574643 -2.112604  1.523709
2013-01-03 -1.019793 -0.160165 -1.796301  0.306590
2013-01-04 -0.125696  1.479283 -0.960221 -1.155188
2013-01-05 -2.392148 -0.253680 -0.523627  0.602100
2013-01-06 -1.892601  1.657452  0.447012  0.490455

In [29]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [31]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [34]:
df2.to_numpy()

AttributeError: 'DataFrame' object has no attribute 'to_numpy'

In [35]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -1.112755  0.370388 -0.921494  0.159336
std    1.008766  1.066638  0.930706  0.985867
min   -2.392148 -1.075204 -2.112604 -1.155188
25%   -1.782954 -0.230302 -1.587281 -0.532090
50%   -1.236903  0.207239 -0.771721  0.398523
75%   -0.349220  1.253123 -0.538525  0.574189
max    0.207720  1.657452  0.447012  1.523709

In [36]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.207720   -1.454012   -1.019793   -0.125696   -2.392148   -1.892601
B   -1.075204    0.574643   -0.160165    1.479283   -0.253680    1.657452
C   -0.583221   -2.112604   -1.796301   -0.960221   -0.523627    0.447012
D   -0.811650    1.523709    0.306590   -1.155188    0.602100    0.490455

In [40]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.811650 -0.583221 -1.075204  0.207720
2013-01-02  1.523709 -2.112604  0.574643 -1.454012
2013-01-03  0.306590 -1.796301 -0.160165 -1.019793
2013-01-04 -1.155188 -0.960221  1.479283 -0.125696
2013-01-05  0.602100 -0.523627 -0.253680 -2.392148
2013-01-06  0.490455  0.447012  1.657452 -1.892601

In [41]:
df.sort_values(by='C')

                   A         B         C         D
2013-01-02 -1.454012  0.574643 -2.112604  1.523709
2013-01-03 -1.019793 -0.160165 -1.796301  0.306590
2013-01-04 -0.125696  1.479283 -0.960221 -1.155188
2013-01-01  0.207720 -1.075204 -0.583221 -0.811650
2013-01-05 -2.392148 -0.253680 -0.523627  0.602100
2013-01-06 -1.892601  1.657452  0.447012  0.490455

In [43]:
df.sort_values(by='D')

                   A         B         C         D
2013-01-04 -0.125696  1.479283 -0.960221 -1.155188
2013-01-01  0.207720 -1.075204 -0.583221 -0.811650
2013-01-03 -1.019793 -0.160165 -1.796301  0.306590
2013-01-06 -1.892601  1.657452  0.447012  0.490455
2013-01-05 -2.392148 -0.253680 -0.523627  0.602100
2013-01-02 -1.454012  0.574643 -2.112604  1.523709

In [48]:
df

                   A         B         C         D
2013-01-01  0.207720 -1.075204 -0.583221 -0.811650
2013-01-02 -1.454012  0.574643 -2.112604  1.523709
2013-01-03 -1.019793 -0.160165 -1.796301  0.306590
2013-01-04 -0.125696  1.479283 -0.960221 -1.155188
2013-01-05 -2.392148 -0.253680 -0.523627  0.602100
2013-01-06 -1.892601  1.657452  0.447012  0.490455

In [50]:
df[:-2]

                   A         B         C         D
2013-01-01  0.207720 -1.075204 -0.583221 -0.811650
2013-01-02 -1.454012  0.574643 -2.112604  1.523709
2013-01-03 -1.019793 -0.160165 -1.796301  0.306590
2013-01-04 -0.125696  1.479283 -0.960221 -1.155188

In [52]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [64]:
%%time
df.T.loc['A', dates[0]]

CPU times: user 488 µs, sys: 26 µs, total: 514 µs
Wall time: 496 µs

0.20771990723702582

In [68]:
%%time
df.T.at['A', dates[0]]

CPU times: user 505 µs, sys: 43 µs, total: 548 µs
Wall time: 533 µs

0.20771990723702582

In [69]:
df.T.loc['A':'C', dates[1]]

A   -1.454012
B    0.574643
C   -2.112604
Name: 2013-01-02 00:00:00, dtype: float64

## Select by position

In [72]:
df

                   A         B         C         D
2013-01-01  0.207720 -1.075204 -0.583221 -0.811650
2013-01-02 -1.454012  0.574643 -2.112604  1.523709
2013-01-03 -1.019793 -0.160165 -1.796301  0.306590
2013-01-04 -0.125696  1.479283 -0.960221 -1.155188
2013-01-05 -2.392148 -0.253680 -0.523627  0.602100
2013-01-06 -1.892601  1.657452  0.447012  0.490455

In [71]:
df.iloc[3]

A   -0.125696
B    1.479283
C   -0.960221
D   -1.155188
Name: 2013-01-04 00:00:00, dtype: float64

In [74]:
df.iloc[0:2]

                   A         B         C         D
2013-01-01  0.207720 -1.075204 -0.583221 -0.811650
2013-01-02 -1.454012  0.574643 -2.112604  1.523709

In [76]:
df.iat[1,1]

0.5746429622019136

## Boolean Indexing

In [80]:
df[df.A > 0]

                  A         B         C        D
2013-01-01  0.20772 -1.075204 -0.583221 -0.81165

In [81]:
df

                   A         B         C         D
2013-01-01  0.207720 -1.075204 -0.583221 -0.811650
2013-01-02 -1.454012  0.574643 -2.112604  1.523709
2013-01-03 -1.019793 -0.160165 -1.796301  0.306590
2013-01-04 -0.125696  1.479283 -0.960221 -1.155188
2013-01-05 -2.392148 -0.253680 -0.523627  0.602100
2013-01-06 -1.892601  1.657452  0.447012  0.490455

In [88]:
df['E'] = ['one', 'two', 'three', 'four', 'five', 'six']

In [89]:
df[df.E.isin(['one'])]

                  A         B         C        D    E
2013-01-01  0.20772 -1.075204 -0.583221 -0.81165  one

In [95]:
df.loc[:, 'E'] = np.array([5]*len(df))

In [96]:
df

                   A         B         C         D  E
2013-01-01  0.207720 -1.075204 -0.583221 -0.811650  5
2013-01-02 -1.454012  0.574643 -2.112604  1.523709  5
2013-01-03 -1.019793 -0.160165 -1.796301  0.306590  5
2013-01-04 -0.125696  1.479283 -0.960221 -1.155188  5
2013-01-05 -2.392148 -0.253680 -0.523627  0.602100  5
2013-01-06 -1.892601  1.657452  0.447012  0.490455  5

In [97]:
df2 = df.copy()

In [99]:
df2[df2 > 0] = -df2

In [100]:
df2

                   A         B         C         D  E
2013-01-01 -0.207720 -1.075204 -0.583221 -0.811650 -5
2013-01-02 -1.454012 -0.574643 -2.112604 -1.523709 -5
2013-01-03 -1.019793 -0.160165 -1.796301 -0.306590 -5
2013-01-04 -0.125696 -1.479283 -0.960221 -1.155188 -5
2013-01-05 -2.392148 -0.253680 -0.523627 -0.602100 -5
2013-01-06 -1.892601 -1.657452 -0.447012 -0.490455 -5

## Operations

In [102]:
df.mean(1)

2013-01-01    0.547529
2013-01-02    0.706347
2013-01-03    0.466066
2013-01-04    0.847636
2013-01-05    0.486529
2013-01-06    1.140464
Freq: D, dtype: float64

In [121]:
df.apply(lambda x: x.min())

A   -2.392148
B   -1.075204
C   -2.112604
D   -1.155188
E    5.000000
dtype: float64

## Merging

In [124]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  2.216553  1.295598  0.643781 -1.973693
1 -0.930994  0.227275  0.621622 -0.772024
2  0.454322  1.369429  0.284719  1.007498
3  0.978134 -0.312683 -0.729730 -1.102899
4  3.083215  0.092828 -0.673218  0.606533
5  1.514860 -0.450510 -0.844669 -0.942019
6 -1.966968  0.104399 -0.466251 -0.636462
7  0.360757 -0.264354 -1.424210  0.505672
8 -0.484466  0.801863  0.112306 -0.058202
9  1.215297  1.014658 -0.616734 -1.153249

In [126]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  2.216553  1.295598  0.643781 -1.973693
 1 -0.930994  0.227275  0.621622 -0.772024
 2  0.454322  1.369429  0.284719  1.007498,
           0         1         2         3
 3  0.978134 -0.312683 -0.729730 -1.102899
 4  3.083215  0.092828 -0.673218  0.606533
 5  1.514860 -0.450510 -0.844669 -0.942019
 6 -1.966968  0.104399 -0.466251 -0.636462,
           0         1         2         3
 7  0.360757 -0.264354 -1.424210  0.505672
 8 -0.484466  0.801863  0.112306 -0.058202
 9  1.215297  1.014658 -0.616734 -1.153249]

In [127]:
pd.concat(pieces)

          0         1         2         3
0  2.216553  1.295598  0.643781 -1.973693
1 -0.930994  0.227275  0.621622 -0.772024
2  0.454322  1.369429  0.284719  1.007498
3  0.978134 -0.312683 -0.729730 -1.102899
4  3.083215  0.092828 -0.673218  0.606533
5  1.514860 -0.450510 -0.844669 -0.942019
6 -1.966968  0.104399 -0.466251 -0.636462
7  0.360757 -0.264354 -1.424210  0.505672
8 -0.484466  0.801863  0.112306 -0.058202
9  1.215297  1.014658 -0.616734 -1.153249

## Join

In [128]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [129]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

## Grouping

In [131]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
   ....:                          'foo', 'bar', 'foo', 'foo'],
   ....:                    'B': ['one', 'one', 'two', 'three',
   ....:                          'two', 'two', 'one', 'three'],
   ....:                    'C': np.random.randn(8),
   ....:                    'D': np.random.randn(8)})

In [132]:
df

     A      B         C         D
0  foo    one -0.480007 -0.877220
1  bar    one  0.019656  0.991766
2  foo    two -0.097582 -0.216072
3  bar  three  1.793690 -0.924886
4  foo    two -0.827811  0.321199
5  bar    two -0.001520  1.340937
6  foo    one  0.303679  0.592350
7  foo  three -0.414298  0.689500

In [134]:
df.groupby('A').sum()

            C         D
A
bar  1.811826  1.407817
foo -1.516019  0.509757

In [137]:
df.groupby(['B', 'A']).sum()

                  C         D
B     A
one   bar  0.019656  0.991766
      foo -0.176328 -0.284870
three bar  1.793690 -0.924886
      foo -0.414298  0.689500
two   bar -0.001520  1.340937
      foo -0.925393  0.105127